'''
Description: 
Version: 
Autor: ivy-liu
Date: 2020-12-23 21:27:19
LastEditors: ivy-liu still me
LastEditTime: 2020-12-23 22:40:17
'''



'''
一、量化投资 
基本定义：大概率、统计学&数学、市场的非有效性
投资特点：高效准确、依赖历史数据、有纪律、程序化

二、理论基础
1.市场有效性假说
价格完全反映了所有可以获得的信息的市场为有效市场
套利交易的逻辑根本点
局部的相对弱有效性甚至无效性策略的出发点

2.现代资产定价理论
--资本资产定价模型

资本资产定价模型 
E(ri)=rf+βim(E(rm)-rf)

rf：无风险利率 
βim：单个证券的系统风险

E(rm)：市场的期望收益率
E(ri)：资产的期望收益率


--套利定价模型

收益使用先行银子模型来表示：
Ri=ai+bi1F1+bi2F2+...+bikFk+∈i

资产的预期收益就应该符合：
E(Ri)=rf+bi1λ1+bi2λ2+...+bikλk

rf：无风险利率
Fj：为因子j偏离其期望值的离差
bij：度量的是资产i，j因子的系统风险
λj：j因子的风险溢价

资本资产定价模型（CAPM）的推广形式

3.投资组合理论
若干种证券组成
收益是加权平均数
能降低非系统性风险

三、量化投资发展趋势
投资体谅及其比重增长
金融工具丰富、产品更加灵活
主动管理alpha与量化alpha结合



'''